Hacker_app/app/controllers/hackers_controller.rb

SELECT "hackers".* FROM "hackers"
---
  def index
    @hackers = Hacker.all

INSERT INTO "hackers" ("name", "age", "school", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Jane"], ["age", 19], ["school", "Upenn"], ["created_at", "2018-02-03 00:43:30.456620"], ["updated_at", "2018-02-03 00:43:30.456620"]]
---
  def create
    @hacker = Hacker.new(hacker_params)

    respond_to do |format|
      if @hacker.save

UPDATE "hackers" SET "age" = ?, "updated_at" = ? WHERE "hackers"."id" = ?  [["age", 23], ["updated_at", "2018-02-03 00:43:53.560679"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @hacker.update(hacker_params)

DELETE FROM "hackers" WHERE "hackers"."id" = ?  [["id", 1]]
---
  def destroy
    @hacker.destroy

SELECT  "hackers".* FROM "hackers" WHERE "hackers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_hacker
      @hacker = Hacker.find(params[:id])